radle0911/prenos_data_preko_nrf/stm32_video_auto_project/stm32_tx_rx_video/spi/spi.c
#include "spi.h"
#include "stm32f4xx.h"
#include "../usart/usart.h"



void initSPI1_accelerometer(uint16_t prescaler)
{
  // Prvo inicijaliziramo pinove sa kojima je povezan SPI protokol
  // na STM32 ploci
  // PA5->SPI1_SCK; PA6->SPI1_MISO; PA7->SPI1_MOSI
  // PA6=>prijemnik, PA7=>predajnik
  {
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOAEN;
    GPIOA->MODER |= GPIO_MODER_MODER5_1 |GPIO_MODER_MODER6_1 |GPIO_MODER_MODER7_1; // Alternate function mode
    GPIOA->OTYPER &= ~(GPIO_OTYPER_OT_5|GPIO_OTYPER_OT_6|GPIO_OTYPER_OT_7);
    GPIOA->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR5_1 |GPIO_OSPEEDER_OSPEEDR6_1 |GPIO_OSPEEDER_OSPEEDR7_1; // fast speed
    GPIOA->PUPDR &= ~(GPIO_PUPDR_PUPDR5|GPIO_PUPDR_PUPDR6|GPIO_PUPDR_PUPDR7);

    GPIOA->AFR[0] |= 0x55550000;
  }

  // Potreban nam je i jedan neovisam gpio pin npr PE3 za high i low CS (chip select)
  {
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOEEN;
    GPIOE->MODER |= (GPIO_MODER_MODER3_0);  // general output mode
    GPIOE->OTYPER &= ~(GPIO_OTYPER_OT_3);
    GPIOE->OSPEEDR |= (GPIO_OSPEEDER_OSPEEDR3_1);   // fast speed
    GPIOE->PUPDR &= ~(GPIO_PUPDR_PUPDR3);
    // Takodjer u .h file je definisano za high i low 
    //
    SPI1_CS_HIGH;
  }

  // inicijalizacija SPI1
  {
    RCC->APB2ENR |= RCC_APB2ENR_SPI1EN;
    SPI1->CR1 |= SPI_CR1_MSTR;    // master configuration
    SPI1->CR1 |= (SPI_CR1_SSM | SPI_CR1_SSI);
    SPI1->CR1 |= prescaler;       // podesavamo BR[2:0] vrijednosti

    SPI1->CR1 |=SPI_CR1_SPE;      // SPI enable
  }
}



uint8_t rxByteSPI1(void)
{
  uint8_t data;

  SPI1->DR = 0x00;
  /*
    Zašto se u SPI šalje "dummy bajt" pri čitanju?
    SPI je full-duplex protokol – svaki put kad master pošalje bajt, on istovremeno prima bajt nazad od slave uređaja.
    Dakle:
    Da bi master mogao da primi bajt → mora poslati nešto!
    Taj bajt koji master pošalje ne mora imati značenje – zovemo ga "dummy byte".
   */

  while (!(SPI1->SR & SPI_SR_TXE));   // cekaj dok TX buffer nije PRAZAN (spreman za slanje novog bajta)
  while (!(SPI1->SR & SPI_SR_RXNE));  // cekaj dok RX buffer NIJE PUN (bajt još nije primljen)
  while (SPI1->SR & SPI_SR_BSY);      // cekaj dok SPI još radi (prenosi), tj. dok nije završen cijeli prenos
  data = SPI1->DR;                    // procitaj primljeni bajt iz DR registra

  return data;
}


uint8_t txByteSPI1(uint8_t data)
{
  uint8_t tmp;

  SPI1->DR = data;    

  while (!(SPI1->SR & SPI_SR_TXE));   // cekaj dok TX buffer nije PRAZAN (spreman za slanje novog bajta)
  while (!(SPI1->SR & SPI_SR_RXNE));  // cekaj dok RX buffer NIJE PUN (bajt još nije primljen)
  while (SPI1->SR & SPI_SR_BSY);      // cekaj dok SPI još radi (prenosi), tj. dok nije zavrsen cijeli prenos
  tmp = SPI1->DR;

  return tmp;
}



uint8_t testSPI1_loopback(void) 
{
    uint8_t sendByte = 0xA5;      // proizvoljan test bajt
    uint8_t receivedByte;

    receivedByte = txByteSPI1(sendByte);
    
    if(receivedByte == sendByte) {
        // test prosao
        return 1;
    } else {
        // test fail
        return 0;
    }
}


// da bi ovo radilo mora se fizicki spojiti PA6 i PA7 
void provjera_loopback_test() // samo se za provjeru koristilo
{
  if(testSPI1_loopback()) {
    printUSART2("primljeno\n");
  } else {
    printUSART2("nije primljeno\n");
  }
}







// WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW NRF24L01 WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW




void initSPI2_nRF24lO1_carrier(uint16_t prescaler)
{
  // Prov inicijaliziramo pinove sa kojima je povezan SPI protokol
  // na STM32 ploci
  // -------------------------------------------------------------
  //
  // PB11 - nRF24L01 CE     no
  //
  //
  // PB12 - nRF24L01 CS     yes
  //
  // PB13 - nRF24L01 CLK    yes
  // PB14 - nRF24L01 MISO   yes
  // PB15 - nRF24L01 MOSI   yes
  // -------------------------------------------------------------
  {
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
    GPIOB->MODER &= ~(GPIO_MODER_MODER13 |GPIO_MODER_MODER14 |GPIO_MODER_MODER15); // Alternate function mode
    GPIOB->MODER |= GPIO_MODER_MODER13_1 |GPIO_MODER_MODER14_1 |GPIO_MODER_MODER15_1; // Alternate function mode
    GPIOB->OTYPER &= ~(GPIO_OTYPER_OT_13|GPIO_OTYPER_OT_14|GPIO_OTYPER_OT_15);
    GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR13_1 |GPIO_OSPEEDER_OSPEEDR14_1 |GPIO_OSPEEDER_OSPEEDR15_1; // fast speed
    GPIOB->PUPDR &= ~(GPIO_PUPDR_PUPDR13|GPIO_PUPDR_PUPDR14|GPIO_PUPDR_PUPDR15);

    GPIOB->AFR[1] |= 0x55500000;
  }

  // Potreban nam je i jedan neovisam gpio pin npr PB12 za high i low CS (chip select)
  {
    GPIOB->MODER &= ~(GPIO_MODER_MODER12);            // moder reset
    GPIOB->MODER |= (GPIO_MODER_MODER12_0);           // general output mode
    GPIOB->OTYPER &= ~(GPIO_OTYPER_OT_12);
    GPIOB->OSPEEDR |= (GPIO_OSPEEDER_OSPEEDR12_1);    // fast speed
    GPIOB->PUPDR &= ~(GPIO_PUPDR_PUPDR12);
    // zatim odma podesavamo CS u HIGH tj ne koristi se 
    SPI2_CS_HIGH;
  }

  // inicijalizacija SPI2
  {
    RCC->APB1ENR |= RCC_APB1ENR_SPI2EN;
    //SPI2->CR1 |= SPI_CR1_MSTR;    // master configuration
    SPI2->CR1 = SPI_CR1_MSTR;    // master configuration
    SPI2->CR1 |= (SPI_CR1_SSM | SPI_CR1_SSI);
    SPI2->CR1 |= prescaler;       // podesavamo BR[2:0] vrijednosti

    SPI2->CR1 |=SPI_CR1_SPE;      // SPI enable
  }
}



uint8_t rxByteSPI2_nRF_carrier(void)
{
  uint8_t data;

  SPI2->DR = 0x00;      
  /*
    Zašto se u SPI šalje "dummy bajt" pri čitanju?
    SPI je full-duplex protokol – svaki put kad master pošalje bajt, on istovremeno prima bajt nazad od slave uređaja.
    Dakle:
    Da bi master mogao da primi bajt → mora poslati nešto!
    Taj bajt koji master pošalje ne mora imati značenje – zovemo ga "dummy byte".
   */

  while (!(SPI2->SR & SPI_SR_TXE));   // cekaj dok TX buffer nije PRAZAN (spreman za slanje novog bajta)
  while (!(SPI2->SR & SPI_SR_RXNE));  // cekaj dok RX buffer NIJE PUN (bajt jos nije primljen)
  while (SPI2->SR & SPI_SR_BSY);      // cekaj dok SPI još radi (prenosi), tj. dok nije zavrsen cijeli prenos
  data = SPI2->DR;                    // procitaj primljeni bajt iz DR registra

  return data;
}


uint8_t txByteSPI2_nRF_carrier(uint8_t data)
{
  uint8_t tmp;

  SPI2->DR = data;    

  while (!(SPI2->SR & SPI_SR_TXE));   // cekaj dok TX buffer nije PRAZAN (spreman za slanje novog bajta)
  while (!(SPI2->SR & SPI_SR_RXNE));  // cekaj dok RX buffer NIJE PUN (bajt jos nije primljen)
  while (SPI2->SR & SPI_SR_BSY);      // cekaj dok SPI još radi (prenosi), tj. dok nije zavrsen cijeli prenos
  tmp = SPI2->DR;

  return tmp;
}


void txSPI2_nRF_carrier(uint8_t * data, uint16_t size)  
{
  uint16_t k;
  for(k=0;k<size;k++)
  {
    txByteSPI2_nRF_carrier(data[k]);
  }
}


void rxSPI2_nRF_carrier(uint8_t * data, uint16_t size)  
{
  uint16_t k;
  for (k=0; k<size; k++) {
    data[k] = rxByteSPI2_nRF_carrier();
  }
}







// WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW NRF24L01 SPI3 WWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWWW




void initSPI3_nRF24lO1(uint16_t prescaler)
{
  // Prov inicijaliziramo pinove sa kojima je povezan SPI protokol
  // na STM32 ploci
  //
  // Inicijalizacija na PB11 - PB15
  //wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww
  // PD6 - nRF24L01 CE
  // PD7 - nRF24L01 CS
  //
  //
  // PB3 - nRF24L01 CLK
  // PB4 - nRF24L01 MISO
  // PB5 - nRF24L01 MOSI
  //---------------------------------------------------------------------	
  //
  //
  // CLK,MOSI i MISO
  {
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIOBEN;
    GPIOB->MODER &= ~(GPIO_MODER_MODER3 |GPIO_MODER_MODER4 |GPIO_MODER_MODER5); // Alternate function mode
    GPIOB->MODER |= GPIO_MODER_MODER3_1 |GPIO_MODER_MODER4_1 |GPIO_MODER_MODER5_1; // Alternate function mode
    GPIOB->OTYPER &= ~(GPIO_OTYPER_OT_3|GPIO_OTYPER_OT_4|GPIO_OTYPER_OT_5);
    GPIOB->OSPEEDR |= GPIO_OSPEEDER_OSPEEDR3_1 |GPIO_OSPEEDER_OSPEEDR4_1 |GPIO_OSPEEDER_OSPEEDR5_1; // fast speed
    GPIOB->PUPDR &= ~(GPIO_PUPDR_PUPDR3|GPIO_PUPDR_PUPDR4|GPIO_PUPDR_PUPDR5);

    GPIOB->AFR[0] &= ~(0x00666000);
    GPIOB->AFR[0] |= 0x00666000;
  }

  // Potreban nam je i jedan neovisam gpio pin npr PD7 za high i low CS (chip select)
  {
    RCC->AHB1ENR |= RCC_AHB1ENR_GPIODEN;
    GPIOD->MODER &= ~(GPIO_MODER_MODER7);            // moder reset
    GPIOD->MODER |= (GPIO_MODER_MODER7_0);           // general output mode
    GPIOD->OTYPER &= ~(GPIO_OTYPER_OT_7);
    GPIOD->OSPEEDR |= (GPIO_OSPEEDER_OSPEEDR7_1);    // fast speed
    GPIOD->PUPDR &= ~(GPIO_PUPDR_PUPDR7);
    // zatim odma podesavamo CS u HIGH tj ne koristi se 
    SPI3_CS_HIGH;
  }

  // inicijalizacija SPI3
  {
    RCC->APB1ENR |= RCC_APB1ENR_SPI3EN;
    //SPI3->CR1 |= SPI_CR1_MSTR;    // master configuration
    SPI3->CR1 = SPI_CR1_MSTR;    // master configuration
    SPI3->CR1 |= (SPI_CR1_SSM | SPI_CR1_SSI);
    SPI3->CR1 |= prescaler;       // podesavamo BR[2:0] vrijednosti

    SPI3->CR1 |= SPI_CR1_SPE;      // SPI enable
  }
}



uint8_t rxByteSPI3_nRF(void)
{
  uint8_t data;

  SPI3->DR = 0x00;      
  /*
    Zasto se u SPI šalje "dummy bajt" pri čitanju?
    SPI je full-duplex protokol – svaki put kad master pošalje bajt, on istovremeno prima bajt nazad od slave uređaja.
    Dakle:
    Da bi master mogao da primi bajt → mora poslati nešto!
    Taj bajt koji master pošalje ne mora imati značenje – zovemo ga "dummy byte".
   */

  while (!(SPI3->SR & SPI_SR_TXE));   // cekaj dok TX buffer nije PRAZAN (spreman za slanje novog bajta)
  while (!(SPI3->SR & SPI_SR_RXNE));  // cekaj dok RX buffer NIJE PUN (bajt jos nije primljen)
  while (SPI3->SR & SPI_SR_BSY);      // cekaj dok SPI još radi (prenosi), tj. dok nije zavrsen cijeli prenos
  data = SPI3->DR;                    // procitaj primljeni bajt iz DR registra

  return data;
}


uint8_t txByteSPI3_nRF(uint8_t data)
{
  uint8_t tmp;

  SPI3->DR = data;    

  while (!(SPI3->SR & SPI_SR_TXE));   // cekaj dok TX buffer nije PRAZAN (spreman za slanje novog bajta)
  while (!(SPI3->SR & SPI_SR_RXNE));  // cekaj dok RX buffer NIJE PUN (bajt jos nije primljen)
  while (SPI3->SR & SPI_SR_BSY);      // cekaj dok SPI još radi (prenosi), tj. dok nije zavrsen cijeli prenos
  tmp = SPI3->DR;

  return tmp;
}


void txSPI3_nRF(uint8_t * data, uint16_t size)  
{
  uint16_t k;
  for(k=0;k<size;k++)
  {
    txByteSPI3_nRF(data[k]);
  }
}


void rxSPI3_nRF(uint8_t * data, uint16_t size)  
{
  uint16_t k;
  for (k=0; k<size; k++) {
    data[k] = rxByteSPI3_nRF();
  }
}



